In [139]:
import pandas as pd

In [140]:
groceries=pd.Series(data=[30,6,'yes','no'],index=['eggs','apples','milk','bread'])
print(groceries)

eggs       30
apples      6
milk      yes
bread      no
dtype: object

In [141]:
groceries.shape

(4,)

In [142]:
groceries.ndim

1

In [143]:
groceries.size

4

In [144]:
groceries.index

Index(['eggs', 'apples', 'milk', 'bread'], dtype='object')

In [145]:
groceries.values

array([30, 6, 'yes', 'no'], dtype=object)

In [146]:
'banana' in groceries

False

In [147]:
'milk' in groceries

True

In [148]:
groceries['eggs']

30

In [149]:
groceries[['milk','bread']]

milk     yes
bread     no
dtype: object

In [150]:
groceries[0]

30

In [151]:
groceries[-1]

'no'

In [152]:
groceries[[2,3]]

milk     yes
bread     no
dtype: object

In [153]:
groceries.loc[['eggs','apples']]

eggs      30
apples     6
dtype: object

In [154]:
groceries.iloc[[2,3]]

milk     yes
bread     no
dtype: object

In [155]:
groceries

eggs       30
apples      6
milk      yes
bread      no
dtype: object

In [156]:
groceries['eggs']=2
groceries

eggs        2
apples      6
milk      yes
bread      no
dtype: object

In [157]:
groceries.drop('apples')

eggs       2
milk     yes
bread     no
dtype: object

In [158]:
groceries.drop('apples',inplace=True)
groceries

eggs       2
milk     yes
bread     no
dtype: object

In [159]:
fruits=pd.Series([10,6,3],['apples','oranges','bananas'])
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [160]:
fruits+2

apples     12
oranges     8
bananas     5
dtype: int64

In [161]:
fruits -2

apples     8
oranges    4
bananas    1
dtype: int64

In [162]:
fruits *2

apples     20
oranges    12
bananas     6
dtype: int64

In [163]:
fruits /2

apples     5.0
oranges    3.0
bananas    1.5
dtype: float64

In [164]:
import numpy as np
np.sqrt(fruits)

apples     3.162278
oranges    2.449490
bananas    1.732051
dtype: float64

In [165]:
np.exp(fruits)

apples     22026.465795
oranges      403.428793
bananas       20.085537
dtype: float64

In [166]:
np.power(fruits,3)

apples     1000
oranges     216
bananas      27
dtype: int64

In [167]:
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [168]:
fruits['bananas']+2

5

In [169]:
fruits.iloc[0]+2

12

In [170]:
fruits[['apples','oranges']]*2

apples     20
oranges    12
dtype: int64

In [171]:
fruits.loc[['apples','oranges']] /2

apples     5.0
oranges    3.0
dtype: float64

In [172]:
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [173]:
groceries

eggs       2
milk     yes
bread     no
dtype: object

In [174]:
groceries *2

eggs          4
milk     yesyes
bread      nono
dtype: object

In [175]:
items={'Bob':pd.Series([245,25,55],index=['bike','pants','watch']),'Alice':pd.Series([40,110,500,45],index=['book','glasses','bike','pants'])}

In [176]:
type(items)

dict

In [177]:
shopping_cart=pd.DataFrame(items)
print(shopping_cart)

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [178]:
data={'Bob':pd.Series([245,25,55]),'Alice':pd.Series([40,110,500,45])}
df=pd.DataFrame(data)
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

In [179]:
shopping_cart.index

Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

In [180]:
shopping_cart.columns

Index(['Bob', 'Alice'], dtype='object')

In [181]:
shopping_cart.values

array([[245., 500.],
       [ nan,  40.],
       [ nan, 110.],
       [ 25.,  45.],
       [ 55.,  nan]])

In [182]:
shopping_cart.shape

(5, 2)

In [183]:
shopping_cart.ndim

2

In [184]:
shopping_cart.size

10

In [185]:
bob_shopping_cart=pd.DataFrame(items,columns=['Bob'])
bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

In [186]:
sel_shopping_cart=pd.DataFrame(items,index=['pants','bike'])
sel_shopping_cart

       Bob  Alice
pants   25     45
bike   245    500

In [187]:
alice_sel_shopping_cart=pd.DataFrame(items,columns=['Alice'],index=['glasses','bike'])
alice_sel_shopping_cart

         Alice
glasses    110
bike       500

In [188]:
data={'Integers':[1,2,3,4],"Floats":[1.5,2.5,3.5,4.5]}
df=pd.DataFrame(data)
df

   Integers  Floats
0         1     1.5
1         2     2.5
2         3     3.5
3         4     4.5

In [189]:
data={'Integers':[1,2,3,4],"Floats":[1.5,2.5,3.5,4.5]}
df=pd.DataFrame(data,index=['label1','label2','label3','label4'])
df

        Integers  Floats
label1         1     1.5
label2         2     2.5
label3         3     3.5
label4         4     4.5

In [190]:
items2=[{'bikes':30,'watches':5,'pants':6},{'glasses':10,'watches':8,'bikes':9,'pants':0}]
df=pd.DataFrame(items2,index=['store1','store2'])
df

        bikes  watches  pants  glasses
store1     30        5      6      NaN
store2      9        8      0     10.0

In [191]:
new_items=[{'bikes':5,'watches':6,'pants':7,'glasses':10}]
new_d=pd.DataFrame(new_items,index=['store3'])
new_d

        bikes  watches  pants  glasses
store3      5        6      7       10

In [192]:
df[['bikes']]

        bikes
store1     30
store2      9

In [193]:
df[['bikes','pants']]

        bikes  pants
store1     30      6
store2      9      0

In [194]:
df.loc['store1']

bikes      30.0
watches     5.0
pants       6.0
glasses     NaN
Name: store1, dtype: float64

In [195]:
df['bikes']['store1']

30

In [196]:
df['shirts']=[15,2]
df

        bikes  watches  pants  glasses  shirts
store1     30        5      6      NaN      15
store2      9        8      0     10.0       2

In [197]:
df['suits']=df['shirts']+df['pants']
df

        bikes  watches  pants  glasses  shirts  suits
store1     30        5      6      NaN      15     21
store2      9        8      0     10.0       2      2

In [198]:
#We create a dictionary from a list of Python dictionaries that will number of items at the new store
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]

# We create new DataFrame with the new_items and provide and index labeled store 3
new_store = pd.DataFrame(new_items, index = ['store 3'])

# We display the items at the new store
new_store

         bikes  pants  watches  glasses
store 3     20     30       35        4

In [199]:
df=df.append(new_store)
df

         bikes  watches  pants  glasses  shirts  suits
store1      30        5      6      NaN    15.0   21.0
store2       9        8      0     10.0     2.0    2.0
store 3     20       35     30      4.0     NaN    NaN

In [200]:
df['new_watches']=df['watches'][1:]
df

         bikes  watches  pants  glasses  shirts  suits  new_watches
store1      30        5      6      NaN    15.0   21.0          NaN
store2       9        8      0     10.0     2.0    2.0          8.0
store 3     20       35     30      4.0     NaN    NaN         35.0

In [201]:
df.insert(5,'shoes',[8,5,10])
df

         bikes  watches  pants  glasses  shirts  shoes  suits  new_watches
store1      30        5      6      NaN    15.0      8   21.0          NaN
store2       9        8      0     10.0     2.0      5    2.0          8.0
store 3     20       35     30      4.0     NaN     10    NaN         35.0

In [202]:
df.pop('new_watches')
df

         bikes  watches  pants  glasses  shirts  shoes  suits
store1      30        5      6      NaN    15.0      8   21.0
store2       9        8      0     10.0     2.0      5    2.0
store 3     20       35     30      4.0     NaN     10    NaN

In [203]:
df=df.drop(['watches','shoes'],axis=1)
df

         bikes  pants  glasses  shirts  suits
store1      30      6      NaN    15.0   21.0
store2       9      0     10.0     2.0    2.0
store 3     20     30      4.0     NaN    NaN

In [205]:
df=df.drop(['store2','store1'],axis=0)
df

         bikes  pants  glasses  shirts  suits
store 3     20     30      4.0     NaN    NaN

In [206]:
df=df.rename(columns={'bikes':'hats'})
df

         hats  pants  glasses  shirts  suits
store 3    20     30      4.0     NaN    NaN

In [207]:
df=df.rename(index={'store 3':'last store'})
df

            hats  pants  glasses  shirts  suits
last store    20     30      4.0     NaN    NaN

In [208]:
df=df.set_index('pants')
df

       hats  glasses  shirts  suits
pants
30       20      4.0     NaN    NaN

In [210]:
items=[{'bikes':20,'pants':30,'watches':35,'shirts':15,'shoes':8,'suits':45},
      {'watches':10,'glasses':50,'bikes':15,'pants':5,'shirts':2,'shoes':5,'suits':7},
      {'bikes':20,'pants':30,'watches':35,'glasses':4,'shoes':10}]
store_items=pd.DataFrame(items,index=['store 1','store 2','store 3'])
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [213]:
x=store_items.isnull()
x

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1  False  False    False   False  False  False     True
store 2  False  False    False   False  False  False    False
store 3  False  False    False    True  False   True    False

In [214]:
x=store_items.isnull().sum()
x

bikes      0
pants      0
watches    0
shirts     1
shoes      0
suits      1
glasses    1
dtype: int64

In [216]:
x=store_items.isnull().sum().sum()
x

3

In [218]:
store_items.count() #counts non null values

bikes      3
pants      3
watches    3
shirts     2
shoes      3
suits      2
glasses    2
dtype: int64

In [220]:
store_items.dropna(axis=0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 2     15      5       10     2.0      5    7.0     50.0

In [221]:
store_items.dropna(axis=1  #TO modify original dataset we could use inplace=True

         bikes  pants  watches  shoes
store 1     20     30       35      8
store 2     15      5       10      5
store 3     20     30       35     10

In [222]:
 store_items.fillna(0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      0.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     0.0     10    0.0      4.0

In [223]:
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [224]:
store_items.fillna(method="ffill",axis=0) #ffill is forward filling copies above values
#nan value in frst row did not get filled bcz there are no previous values

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     2.0     10    7.0      4.0

In [225]:
store_items.fillna(method="ffill",axis=1) #ffill is forward filling copies left side values

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0     45.0
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    35.0   10.0   10.0      4.0

In [226]:
store_items.fillna(method="backfill",axis=1) #backfill is backward filling copies right side values

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0      NaN
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    10.0   10.0    4.0      4.0

In [227]:
store_items.fillna(method="backfill",axis=0) #backfill is backward filling copies below values

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0     50.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [228]:
store_items.interpolate(method='linear',axis=0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     2.0     10    7.0      4.0

In [230]:
store_items.interpolate(method='linear',axis=1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0     45.0
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    22.5   10.0    7.0      4.0

In [231]:
store_items.isnull().any()

bikes      False
pants      False
watches    False
shirts      True
shoes      False
suits       True
glasses     True
dtype: bool

In [232]:
store_items.describe()

,bikes,pants,watches,shirts,shoes,suits,glasses
count,3.000000,3.000000,3.000000,2.000000,3.000000,2.000000,2.000000
mean,18.333333,21.666667,26.666667,8.500000,7.666667,26.000000,27.000000
std,2.886751,14.433757,14.433757,9.192388,2.516611,26.870058,32.526912
min,15.000000,5.000000,10.000000,2.000000,5.000000,7.000000,4.000000
25%,17.500000,17.500000,22.500000,5.250000,6.500000,16.500000,15.500000
50%,20.000000,30.000000,35.000000,8.500000,8.000000,26.000000,27.000000
75%,20.000000,30.000000,35.000000,11.750000,9.000000,35.500000,38.500000
max,20.000000,30.000000,35.000000,15.000000,10.000000,45.000000,50.000000

In [233]:
store_items['bikes'].describe()

count     3.000000
mean     18.333333
std       2.886751
min      15.000000
25%      17.500000
50%      20.000000
75%      20.000000
max      20.000000
Name: bikes, dtype: float64

In [234]:
store_items.mean()

bikes      18.333333
pants      21.666667
watches    26.666667
shirts      8.500000
shoes       7.666667
suits      26.000000
glasses    27.000000
dtype: float64

In [235]:
store_items.min()

bikes      15.0
pants       5.0
watches    10.0
shirts      2.0
shoes       5.0
suits       7.0
glasses     4.0
dtype: float64

In [236]:
store_items.corr()

            bikes     pants   watches  shirts     shoes  suits  glasses
bikes    1.000000  1.000000  1.000000     1.0  0.917663    1.0     -1.0
pants    1.000000  1.000000  1.000000     1.0  0.917663    1.0     -1.0
watches  1.000000  1.000000  1.000000     1.0  0.917663    1.0     -1.0
shirts   1.000000  1.000000  1.000000     1.0  1.000000    1.0      NaN
shoes    0.917663  0.917663  0.917663     1.0  1.000000    1.0     -1.0
suits    1.000000  1.000000  1.000000     1.0  1.000000    1.0      NaN
glasses -1.000000 -1.000000 -1.000000     NaN -1.000000    NaN      1.0

In [ ]:
# CHECKOUT read_csv() and groupby() functions from any online sources M damn lazy to do them in notebook now.